#### PressureDrop Property

---

|  |
| --- |
| DuctPressureDropData Class   See Also |

The pressure drop of the duct. Units: (kg/(ftÂ·sÂ²)).

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double PressureDrop { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PressureDrop As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double PressureDrop { 	double get (); 	void set (double value); } ``` |

# See Also

DuctPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace